app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 129], ["LIMIT", 1]]
---
    def show
        book = Book.find(params[:id])