app/controllers/checkouts_controller.rb

INSERT INTO "checkouts" ("user_id", "book_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 1], ["book_id", 1]]
---
    def create
        new_checkout = Checkout.create(checkout_params)

SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
DELETE FROM "checkouts" WHERE "checkouts"."id" = $1  [["id", 30]]
---
    def destroy
        checkout = Checkout.find(params[:id])
        checkout.destroy