app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", ""], ["created_at", "2020-09-07 11:38:35.373781"], ["updated_at", "2020-09-07 11:38:35.373781"]]
---
    def create
        new_user = User.create(user_params)